In [1]:
import pandas as pd
import requests

In [3]:
ep = "https://raw.githubusercontent.com/ppabam/nextjs-fastapi-starter/refs/heads/main/endpoints.json"

In [4]:
res = requests.get(ep)

In [5]:
res.status_code

200

In [6]:
res.encoding

'utf-8'

In [7]:
res.text

'{\n    "endpoints": [\n      {"name": "TOM","url": "https://ac.sunsin.shop/api/py/select_all"},\n      {"name": "jiwon","url": "https://agecal.wodan10.shop/api/py/select_all"},\n      {"name": "heejin","url": "https://age.journeyjean.shop/api/py/select_all"}, \n      {"name": "hyun","url": "https://agecalculator.calcalhan.store/api/py/select_all"},\n      {"name": "cho","url": "https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all"},\n      {"name": "jacob","url": "https://jacob0503.vercel.app/api/py/select_table"},\n      {"name": "nuni","url": "https://ac.nunininu.shop/api/py/select_all"},\n      {"name": "lucas","url": "https://ac.lucas12.store/api/py/select_all"},\n      {"name": "SEO","url":"https://ac.seo-sigma.shop/api/py/select_all"},\n      {"name": "JERRY", "url": "https://jooon.vercel.app/api/py/select_all"}\n    ]\n}\n  \n'

In [8]:
data = res.json()

In [11]:
type(data)

dict

In [12]:
endpoints = data['endpoints']
type(endpoints)

list

In [16]:
for p in endpoints:
    print(p)

{'name': 'TOM', 'url': 'https://ac.sunsin.shop/api/py/select_all'}
{'name': 'jiwon', 'url': 'https://agecal.wodan10.shop/api/py/select_all'}
{'name': 'heejin', 'url': 'https://age.journeyjean.shop/api/py/select_all'}
{'name': 'hyun', 'url': 'https://agecalculator.calcalhan.store/api/py/select_all'}
{'name': 'cho', 'url': 'https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all'}
{'name': 'jacob', 'url': 'https://jacob0503.vercel.app/api/py/select_table'}
{'name': 'nuni', 'url': 'https://ac.nunininu.shop/api/py/select_all'}
{'name': 'lucas', 'url': 'https://ac.lucas12.store/api/py/select_all'}
{'name': 'SEO', 'url': 'https://ac.seo-sigma.shop/api/py/select_all'}
{'name': 'JERRY', 'url': 'https://jooon.vercel.app/api/py/select_all'}

In [18]:
for p in endpoints:
    print(f"{p['name']}, {p['url']}")

TOM, https://ac.sunsin.shop/api/py/select_all
jiwon, https://agecal.wodan10.shop/api/py/select_all
heejin, https://age.journeyjean.shop/api/py/select_all
hyun, https://agecalculator.calcalhan.store/api/py/select_all
cho, https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all
jacob, https://jacob0503.vercel.app/api/py/select_table
nuni, https://ac.nunininu.shop/api/py/select_all
lucas, https://ac.lucas12.store/api/py/select_all
SEO, https://ac.seo-sigma.shop/api/py/select_all
JERRY, https://jooon.vercel.app/api/py/select_all

In [15]:
for i in range(len(endpoints)):
    print(endpoints[i])

{'name': 'TOM', 'url': 'https://ac.sunsin.shop/api/py/select_all'}
{'name': 'jiwon', 'url': 'https://agecal.wodan10.shop/api/py/select_all'}
{'name': 'heejin', 'url': 'https://age.journeyjean.shop/api/py/select_all'}
{'name': 'hyun', 'url': 'https://agecalculator.calcalhan.store/api/py/select_all'}
{'name': 'cho', 'url': 'https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all'}
{'name': 'jacob', 'url': 'https://jacob0503.vercel.app/api/py/select_table'}
{'name': 'nuni', 'url': 'https://ac.nunininu.shop/api/py/select_all'}
{'name': 'lucas', 'url': 'https://ac.lucas12.store/api/py/select_all'}
{'name': 'SEO', 'url': 'https://ac.seo-sigma.shop/api/py/select_all'}
{'name': 'JERRY', 'url': 'https://jooon.vercel.app/api/py/select_all'}

In [76]:
#df_jiwon
res = requests.get('https://agecal.wodan10.shop/api/py/select_all')
#res.status_code
data = res.json()
df_jiwon = pd.DataFrame(data)
df_jiwon.head(5)

  menu_name    name          dt
0       짜장면     TOM  2025-02-03
1      제육볶음    nuni  2025-02-03
2      제육볶음   lucas  2025-02-03
3      샌드위치  heejin  2025-02-03
4     김치 찌개   jacob  2025-02-03

In [77]:
#df_tom 
res = requests.get('https://ac.sunsin.shop/api/py/select_all')
#res.status_code
data = res.json()
df_tom = pd.DataFrame(data)
df_tom.head(10)

       menu_name   name          dt
0            설렁탕    TOM  2025-02-07
1      설렁탕,육회비빔밥    SEO  2025-02-07
2  시래기찜닭, 마라로제찜닭   hyun  2025-02-07
3          고등어구이  JERRY  2025-02-10
4    제육볶음, 고등어구이   hyun  2025-02-10
5          순두부찌개   nuni  2025-02-11
6             뷔페   hyun  2025-02-11
7           김치찌개   nuni  2025-02-10
8         참치김치찌개  jacob  2025-02-11
9           된장찌개  jacob  2025-02-10

In [112]:
#df_jerry
res = requests.get('https://jooon.vercel.app/api/py/select_all')
#res.status_code
data = res.json()
df_JERRY = pd.DataFrame(data)
df_JERRY.head(10)

      menu_name    name          dt
0   베이컨토마토디럭스세트   JERRY  2025-02-06
1           순대국     TOM  2025-01-07
2           닭개장     CHO  2025-01-07
3  닭개장(특) , 꽈배기    HYUN  2025-01-07
4           닭개장   JERRY  2025-01-07
5           볶음밥     SEO  2025-01-07
6           닭개장   JIWON  2025-01-07
7           자장면   JACOB  2025-01-07
8            덮밥  HEEJIN  2025-01-07
9           볶음밥   LUCAS  2025-01-07

In [78]:
from pandasql import sqldf

query = """
SELECT df_tom.menu_name, df_tom.name, df_tom.dt
FROM df_tom
LEFT JOIN df_jiwon
ON df_tom.menu_name = df_jiwon.menu_name 
AND df_tom.name = df_jiwon.name 
AND df_tom.dt = df_jiwon.dt
WHERE df_jiwon.menu_name IS NULL
"""

pysqldf = lambda q: sqldf(q, globals())

def pysqldf(q):
    sqldf(q, locals())

df_diff_1 = sqldf(query, locals()) 
df_diff_1

       menu_name   name          dt
0            설렁탕    TOM  2025-02-07
1      설렁탕,육회비빔밥    SEO  2025-02-07
2  시래기찜닭, 마라로제찜닭   hyun  2025-02-07
3          고등어구이  JERRY  2025-02-10
4    제육볶음, 고등어구이   hyun  2025-02-10
5          순두부찌개   nuni  2025-02-11
6             뷔페   hyun  2025-02-11
7           김치찌개   nuni  2025-02-10
8         참치김치찌개  jacob  2025-02-11
9           된장찌개  jacob  2025-02-10

In [79]:
# 나의 df에 없는 row를 찾아서 새로운 데이터 프레임으로 만들기

new_rows = []

for _, row in df_tom.iterrows():
    is_match_row = False
    for _, row2 in df_jiwon.iterrows():
        is_match_columns = True
        for col in df_jiwon.columns:
            if row[col] != row2[col]:
                is_match_columns = False
                break
        if is_match_columns:
            is_match_row = True
            break  # 더 이상 df1에서 비교할 필요 없음
    
    if not is_match_row:
        new_rows.append(row)
        
df_new = pd.DataFrame(new_rows)
df_new

       menu_name   name          dt
0            설렁탕    TOM  2025-02-07
1      설렁탕,육회비빔밥    SEO  2025-02-07
2  시래기찜닭, 마라로제찜닭   hyun  2025-02-07
3          고등어구이  JERRY  2025-02-10
4    제육볶음, 고등어구이   hyun  2025-02-10
5          순두부찌개   nuni  2025-02-11
6             뷔페   hyun  2025-02-11
7           김치찌개   nuni  2025-02-10
8         참치김치찌개  jacob  2025-02-11
9           된장찌개  jacob  2025-02-10

In [123]:
# 나의 df에 없는 row를 찾아서 새로운 데이터 프레임으로 만들기

new_rows = []

for _, row2 in df_JERRY.iterrows():
    is_match_row = False
    for _, row1 in df_jiwon.iterrows():
        is_match_columns = True
        for col in df_jiwon.columns:
            if row2[col] != row1[col]:
                is_match_columns = False
                break
        if is_match_columns:
            is_match_row = True
            break  # 더 이상 df1에서 비교할 필요 없음
    
    if not is_match_row:
        new_rows.append(row2)
        
df_new = pd.DataFrame(new_rows)
df_new

        menu_name    name          dt
0     베이컨토마토디럭스세트   JERRY  2025-02-06
2             닭개장     CHO  2025-01-07
3    닭개장(특) , 꽈배기    HYUN  2025-01-07
6             닭개장   JIWON  2025-01-07
7             자장면   JACOB  2025-01-07
..            ...     ...         ...
140         김치 찌개   JACOB  2025-02-03
141          샌드위치  HEEJIN  2025-02-03
142          제육볶음   LUCAS  2025-02-03
143          제육볶음    NUNI  2025-02-03
144            라면   JERRY  2025-02-09

[103 rows x 3 columns]

### 나의 df에 없는 row를 찾아서 새로운 데이터 프레임으로 만들기
-> pandasql을 이용하는 방법

In [25]:
df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4], "name": ["MIN", "LEE", "PARK"]})

In [47]:
df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4, 5], "name": ["MIN", "LEE", "PARK", "TOM"]})
df3 = pd.DataFrame({"id": [5, 4, 2, 3], "name": ["TOM", "PARK","MIN", "LEE"]})

In [57]:
from pandasql import sqldf
query = """
SELECT df2.id, df2.name
FROM df2
LEFT JOIN df1
ON df2.id = df1.id AND df2.name = df1.name
WHERE df1.id IS NULL
"""

#pysqldf = lambda q: sqldf(q, globals())

def pysqldf(q):
    sqldf(q, locals())

df_diff_1 = sqldf(query, locals()) 
df_diff_1

   id  name
0   4  PARK
1   5   TOM

### 나의 df에 없는 row를 찾아서 새로운 데이터 프레임으로 만들기
-> for 문을 이용하는 방법

In [49]:
new_rows = []

for _, row2 in df2.iterrows():
    is_match_row = False
    for _, row1 in df1.iterrows():
        is_match_columns = True
        for col in df1.columns:
            if row2[col] != row1[col]:
                is_match_columns = False
                break
        if is_match_columns:
            is_match_row = True
            break  # 더 이상 df1에서 비교할 필요 없음
            
    if not is_match_row:
        new_rows.append(row2)
        
df_diff_2 = pd.DataFrame(new_rows)
df_diff_2

   id  name
2   4  PARK
3   5   TOM

### 나의 df에 없는 row를 찾아서 새로운 데이터 프레임으로 만들기
-> pandas merge를 이용하는 방법

In [50]:
merge_df = pd.merge(df1, df2, how='right', indicator=True)

In [51]:
merge_df

   id  name      _merge
0   2   MIN        both
1   3   LEE        both
2   4  PARK  right_only
3   5   TOM  right_only

In [52]:
# _merge가 right_only 인것만 남기고 _merge column은 지우기

df_diff_3 = merge_df[merge_df['_merge'] == 'right_only'].drop('_merge',axis=1)
df_diff_3

   id  name
2   4  PARK
3   5   TOM

In [53]:
## TODO
#df_diff_1, df_diff_2, df_diff_3 의 결과가 같은지 비교
#df_diff_1 == df_diff_2 == df_diff_3

In [54]:
df_diff_1.equals(df_diff_2)

False

In [55]:
df_diff_1.reset_index(drop=True).equals(df_diff_3.reset_index(drop=True))

True

In [56]:
df_diff_2.equals(df_diff_2)

True